Revit 2026 API

# ElectricalSystemSystemType Property

---

The Electrical System Type of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElectricalSystemType SystemType { get; }
```
```vb
Public ReadOnly Property SystemType As ElectricalSystemType
	Get
```
```cpp
public:
property ElectricalSystemType SystemType {
	ElectricalSystemType get ();
}
```
```fsharp
member SystemType : ElectricalSystemType with get
```

#### Property Value

ElectricalSystemType

This property is used to retrieve the Electrical System Type of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace